# Profile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoopsProfile..::..Profile Property
CurveLoopsProfile Class See Also
---
Returns the curve loops of the profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArrArray Profile { get; set; }
```

Visual Basic
---
```text
Public Property Profile As CurveArrArray
	Get
	Set
```

Visual C++
---
```text
public:
property CurveArrArray^ Profile {
	CurveArrArray^ get ();
	void set (CurveArrArray^ value);
}
```

# Remarks
This property is used to retrieve the curve loops of profile.
# See Also
CurveLoopsProfile Class
Autodesk.Revit.DB Namespace